# Example
latin_alphabet = {
    'Spanish': ['á', 'é', 'í', 'ó', 'ú', 'ü', 'ñ', 'Á', 'É', 'Í', 'Ó', 'Ú', 'Ü', 'Ñ'],
    'French': ['à', 'â', 'é', 'è', 'ê', 'ë', 'î', 'ï', 'ô', 'œ', 'ù', 'û', 'ç', 'À', 'Â', 'É', 'È', 'Ê', 'Ë', 'Î', 'Ï', 'Ô', 'Œ', 'Ù', 'Û', 'Ç'],
    'Portuguese': ['á', 'â', 'ã', 'à', 'é', 'ê', 'í', 'ó', 'ô', 'õ', 'ú', 'ü', 'ç', 'Á', 'Â', 'Ã', 'À', 'É', 'Ê', 'Í', 'Ó', 'Ô', 'Õ', 'Ú', 'Ü', 'Ç'],
    'Italian': ['à', 'è', 'é', 'ì', 'í', 'ò', 'ó', 'ù', 'ú', 'À', 'È', 'É', 'Ì', 'Í', 'Ò', 'Ó', 'Ù', 'Ú'],
    'German': ['ä', 'ö', 'ü', 'ß', 'Ä', 'Ö', 'Ü'],
    'Dutch': ['é', 'è', 'ë', 'ê', 'ï', 'ö', 'ô', 'ü', 'á', 'à', 'ã', 'É', 'È', 'Ë', 'Ê', 'Ï', 'Ö', 'Ô', 'Ü', 'Á', 'À', 'Ã'],
    'Swedish': ['å', 'ä', 'ö', 'Å', 'Ä', 'Ö'],
    'Danish': ['æ', 'ø', 'å', 'Æ', 'Ø', 'Å'],
    'Norwegian': ['æ', 'ø', 'å', 'Æ', 'Ø', 'Å'],
    'Finnish': ['ä', 'ö', 'å', 'Ä', 'Ö', 'Å'],
    'Icelandic': ['á', 'í', 'ó', 'ú', 'ý', 'þ', 'æ', 'ö', 'Á', 'Í', 'Ó', 'Ú', 'Ý', 'Þ', 'Æ', 'Ö'],
    'Romanian': ['ă', 'â', 'î', 'ș', 'ț', 'Ă', 'Â', 'Î', 'Ș', 'Ț'],
    'Polish': ['ą', 'ć', 'ę', 'ł', 'ń', 'ó', 'ś', 'ż', 'ź', 'Ą', 'Ć', 'Ę', 'Ł', 'Ń', 'Ó', 'Ś', 'Ż', 'Ź'],
    "Czech" : ['á', 'č', 'ď', 'é', 'ě', 'í', 'ň', 'ó', 'ř', 'š', 'ť', 'ú', 'ů', 'ý', 'ž', 'Á', 'Č', 'Ď', 'É',
                      'Ě', 'Í', 'Ň', 'Ó', 'Ř', 'Š', 'Ť', 'Ú', 'Ů', 'Ý', 'Ž'],
    'Slovak': ['á', 'ä', 'č', 'ď', 'é', 'í', 'ĺ', 'ľ', 'ň', 'ó', 'ô', 'ŕ', 'š', 'ť', 'ú', 'ý', 'ž', 'Á', 'Ä', 'Č', 'Ď', 'É', 'Í', 'Ĺ', 'Ľ', 'Ň', 'Ó', 'Ô', 'Ŕ', 'Š', 'Ť', 'Ú', 'Ý', 'Ž'],
    'Hungarian': ['á', 'é', 'í', 'ó', 'ö', 'ő', 'ú', 'ü', 'ű', 'Á', 'É', 'Í', 'Ó', 'Ö', 'Ő', 'Ú', 'Ü', 'Ű'],
    'Latvian': ['ā', 'č', 'ē', 'ģ', 'ī', 'ķ', 'ļ', 'ņ', 'š', 'ū', 'ž', 'Ā', 'Č', 'Ē', 'Ģ', 'Ī', 'Ķ', 'Ļ', 'Ņ', 'Š', 'Ū', 'Ž'],
    'Lithuanian': ['ą', 'č', 'ę', 'ė', 'į', 'š', 'ų', 'ū', 'ž', 'Ą', 'Č', 'Ę', 'Ė', 'Į', 'Š', 'Ų', 'Ū', 'Ž'],
    'Estonian': ['ä', 'ö', 'ü', 'õ', 'š', 'ž', 'Ä', 'Ö', 'Ü', 'Õ', 'Š', 'Ž'],
    "Other": ["ǎ"],
    "all_symbols" : [
        ",", ".", " ", "!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "-", "_",
        "=", "+", "[", "{", "]", "}", "\\", "|", ";", ":", "'", "\"", "<", ",",
        ">", ".", "/", "?", "~", "`", "§", "±", "€", "£", "¥", "₹"
    ],
    "numbers": ["0","1","2","3","4","5","6","7","8","9"],
    "english": [x for x in "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ"]
}

vocab = set()
for lang in latin_alphabet:
    vocab.update(latin_alphabet[lang])
vocab = list(vocab)
vocab.sort()

# write out one character per line, handle unicode characters
with open("vocab.txt", "wb") as f:
    for char in vocab:
        f.write(char.encode("utf-8"))
        f.write("\n".encode("utf-8"))